---
kind: other
id: Properties.T:Autodesk.Revit.ApplicationServices.ControlledApplication
source: html/97358e8b-c07f-af92-424e-9c6d9f0c6043.htm
---
# ControlledApplication Properties

Retrieves the Id of the currently running external application.